var btn3 = document.getElementById("dalees");
var btn4 = document.getElementById("skrits");

function buttonClicked3() {


    document.getElementById("texts").innerHTML = "Птицы садятся на землю – завтра тепло будет.<br>Птицы сидят на нижних ветках деревьев – жди ветер.<br\>Вороны каркают стаей – к ненастью.<br>\
    Дождевые облака круглые – дождь будет кратковременный; дождевые облака плоские – дождь будет идти долго.<br>\
    Утром туман поднимается и образует облака – будет дождь, а коли туман падает на землю – будет сухо.<br>\
    Ранняя весна – летом много непогожих дней будет.<br>\
    Длинные сосульки – весна будет долгой.<br>\
    Рябина обильно цветет – сырая осень будет, а коли мало рябины – жди сухую осень.<br>\
    Позднее цветение рябины – к долгой и теплой осени.<br>\
    Кора на деревьях сильно потрескалась – хорошая погода без дождя продержится долго.<br>\
    Весна придет рано – готовься к ранней зиме.<br>\
    Коли снег тает быстро, а вода бежит обильно – к мокрому лету.<br>\
    Снег тает с северной стороны от муравейника – лето будет долгое и теплое, а с южной стороны от муравейника –жди лето короткое и холодное.<br>\
    Весной дождей нет – будет дождливая осень.<br>\
    Весна очень теплая – жди холодное лето.<br>\
    Грачи прилетели – через месяц снег сойдет.<br>\
    Дикие утки прилетели упитанные – весна будет долгая и холодная.<br>\
    Птицы вьют гнезда на солнечной стороне – жди холодное лето.<br>\
    Много паутины летит – быть лету жарким.<br>\
    Из берёзы течет много сока – жди дождливое лето.<br>\
    Береза распустила листья раньше ольхи – сухое лето, ольха распустилась раньше березы – дождливое лето.<br>\
    Одуванчики зацвели ранней весной – лето будет коротким.<br> "
}

function buttonClicked4() {
    console.log(document.getElementById("texts").innerHTML);
    document.getElementById("texts").innerHTML = "";
}

btn3.addEventListener("click", buttonClicked3);
btn4.addEventListener("click", buttonClicked4);
