var btn7 = document.getElementById("daleew");
var btn8 = document.getElementById("skritw");

function buttonClicked7() {


    document.getElementById("textw").innerHTML = "Туман зимой – к оттепели.<br>\
                Деревья стоят в инее - к потеплению.<br>\
                Снег налип на ветви деревьев – к продолжительному теплу.<br>\
                Трескучий лед – к продолжительному морозу.<br>\
                Дым столбом – к морозу, дым низко стелется по земле – к снегу и дождю.<br>\
                Иней на окне растет вверх – мороз простоит несколько дней; иней стал сгибаться вниз – к оттепели.<br>\
                Вороны и галки кричат беспрерывно – к снегопаду или метели.<br>\
                Вороны и галки вьются в воздухе – снег пойдет.<br>\
                Кошка сворачивается клубком в кресле– к похолоданию.<br>\
                Кошка мордочку прячет – к морозу или к вьюге.<br>\
                Кошка когти точит – жди метель.<br>\
                Кот по комнате бегает, играет – к морозу.<br>\
                Кошка крепко спит или ложится на спину – к потеплению.<br>\
                Кошка о ноги трется да в окно смотрит – жди потепление.<br>\
                Собака в снегу валяется – к метели.<br>\
                Природа зиму чередует: коли холодная была зима – следующая зима теплой будет.<br>\
                Большой снег в начале зимы – к обильным дождям в начале лета.<br>\
                Снег лег на сырую землю и не растаял – весной подснежники зацветут рано.<br>\
                Если снег выпал рано – жди ранний приход весны.<br>\
                Каков январь, таков и июль.<br>\
                Если в январе частые снегопады и метели – в июле жди частые дожди.<br>\
                Зима морозная – лето жаркое.<br>\
                Сухая и холодная зима ведет за собою сухое и жаркое лето.<br>\
                Зима была теплой – жди лето холодное.<br>"
}

function buttonClicked8() {
    console.log(document.getElementById("textw").innerHTML);
    document.getElementById("textw").innerHTML = "";
}

btn7.addEventListener("click", buttonClicked7);
btn8.addEventListener("click", buttonClicked8);
